brzk4/Modbus-slave-STM8s/Libraries/STM8_TouchSensing_Driver/src/stm8l15x_tsl_ct_acquisition.c
#if NUMBER_OF_SINGLE_CHANNEL_PORTS > 2
    , SCKEY_P3_A
#if SCKEY_P3_KEY_COUNT > 1
    , SCKEY_P3_B
#endif
#if SCKEY_P3_KEY_COUNT > 2
    , SCKEY_P3_C
#endif
#if SCKEY_P3_KEY_COUNT > 3
    , SCKEY_P3_D
#endif
#if SCKEY_P3_KEY_COUNT > 4
    , SCKEY_P3_E
#endif
#if SCKEY_P3_KEY_COUNT > 5
    , SCKEY_P3_F
#endif
#if SCKEY_P3_KEY_COUNT > 6
    , SCKEY_P3_G
#endif
#if SCKEY_P3_KEY_COUNT > 7
    , SCKEY_P3_H
#endif
#endif
  };
#endif

#if NUMBER_OF_MULTI_CHANNEL_KEYS > 0
CONST u16 Table_MCKEY_PORTS[
#if NUMBER_OF_MULTI_CHANNEL_KEYS == 1
  CHANNEL_PER_MCKEY
#endif
#if NUMBER_OF_MULTI_CHANNEL_KEYS == 2
  CHANNEL_PER_MCKEY + CHANNEL_PER_MCKEY
#endif
] =
  {
    MCKEY1_A_CH
    , MCKEY1_B_CH
    , MCKEY1_C_CH
#if CHANNEL_PER_MCKEY > 3
    , MCKEY1_D_CH
    , MCKEY1_E_CH
#endif
#if CHANNEL_PER_MCKEY > 5
    , MCKEY1_F_CH
    , MCKEY1_G_CH
    , MCKEY1_H_CH
#endif
#if NUMBER_OF_MULTI_CHANNEL_KEYS > 1
    , MCKEY2_A_CH
    , MCKEY2_B_CH
    , MCKEY2_C_CH
#if CHANNEL_PER_MCKEY > 3
    , MCKEY2_D_CH
    , MCKEY2_E_CH
#endif
#if CHANNEL_PER_MCKEY > 5
    , MCKEY2_F_CH
    , MCKEY2_G_CH
    , MCKEY2_H_CH
#endif
#endif
  };
#endif


#if NUMBER_OF_MULTI_CHANNEL_KEYS > 0
CONST u8 Table_MCKEY_BITS[
#if NUMBER_OF_MULTI_CHANNEL_KEYS == 1
  CHANNEL_PER_MCKEY
#elif NUMBER_OF_MULTI_CHANNEL_KEYS == 2
  CHANNEL_PER_MCKEY + CHANNEL_PER_MCKEY
#endif
] =
  {
    MCKEY1_A
    , MCKEY1_B
    , MCKEY1_C
#if CHANNEL_PER_MCKEY > 3
    , MCKEY1_D
    , MCKEY1_E
#endif
#if CHANNEL_PER_MCKEY > 5
    , MCKEY1_F
    , MCKEY1_G
    , MCKEY1_H
#endif
#if NUMBER_OF_MULTI_CHANNEL_KEYS > 1
    , MCKEY2_A
    , MCKEY2_B
    , MCKEY2_C
#if CHANNEL_PER_MCKEY > 3
    , MCKEY2_D
    , MCKEY2_E
#endif
#if CHANNEL_PER_MCKEY > 5
    , MCKEY2_F
    , MCKEY2_G
    , MCKEY2_H
#endif
#endif
  };
#endif

#if SPREAD_SPECTRUM && SW_SPREAD_SPECTRUM
/**
  ******************************************************************************
  * @brief Spread Spectrum waiting routine. A variable delay is
  * inserted between each step.
  * @par Parameters:
  * None
  * @retval void None
  * @par Required preconditions:
  * SPREAD_SPECTRUM must be defined and not null in the configuration file
 * SW_SPREAD_SPECTRUM must be defined and not null in the configuration file
  ******************************************************************************
  */
INLINE void TSL_SW_Spread_Spectrum(void)
{
  u8 i;

  SpreadCounter++;

  if (SpreadCounter == SPREAD_COUNTER_MAX)
  {
    SpreadCounter = SPREAD_COUNTER_MIN;
  }
  i = SpreadCounter;
  while (--i);

}
#endif /* SPREAD_SPECTRUM && SW_SPREAD_SPECTRUM */


/**
  ******************************************************************************
  * @brief Init for I/Os used in the application. Used for SW I/O toggling.
  * If the hardware cell is used, the responsability of the I/O configuration is
  * given to the user layer.
  * @par Parameters:
  * None
  * @retval void None
  * @par Required preconditions:
  * None
  ******************************************************************************
  */
void TSL_IO_Init(void)
{

  /*init the IO to use with the TS controller registers*/

  /*Enable the TS IP clcock*/
  CLK->PCKENR2 |= 0x20;

  /*initialization of TS IP*/

  //select which IOs will be managed by the TS IP
  CCMR_P1   = SCKEY_P1_MASK;
#if NUMBER_OF_ACQUISITION_PORTS > 1
  CCMR_P2   = SCKEY_P2_MASK;
#endif
  CCMR_SAMP = SAMP_CAP_MASK;

  //select which channel will be enabled
  IOSR_P1   = SCKEY_P1_MASK;
#if NUMBER_OF_ACQUISITION_PORTS > 1
  IOSR_P2   = SCKEY_P2_MASK;
#endif
  IOSR_SAMP = SAMP_CAP_MASK;
#if ACTIVE_SHIELD_GROUP
	ACTIVE_SHIELD_P1_PORT->DDR &= (uint8_t)(~ACTIVE_SHIELD_P1_BIT);
	ACTIVE_SHIELD_P1_PORT->CR1 &= (uint8_t)(~ACTIVE_SHIELD_P1_BIT);
	ACTIVE_SHIELD_P2_PORT->DDR &= (uint8_t)(~ACTIVE_SHIELD_P2_BIT);
	ACTIVE_SHIELD_P2_PORT->CR1 &= (uint8_t)(~ACTIVE_SHIELD_P2_BIT);
#endif
  TSL_IO_Clamp();

}


/**
  ******************************************************************************
  * @brief Put All Sensing I/Os in ouput mode at 0.
  * @par Parameters:
  * None
  * @retval void None
  * @par Required preconditions:
  * None
  ******************************************************************************
  */
void TSL_IO_Clamp(void)
{

  //All IO in input with the analog switch OPEN
  RI->IOGCR = CGCR_P1_SW_OPEN_MASK | CGCR_SAMP_SW_OPEN_MASK
#if NUMBER_OF_ACQUISITION_PORTS > 1
              | CGCR_P2_SW_OPEN_MASK
#endif
              ;

  //All IO to pushpull LOW for discharging all capacitors (Ctouch and Csense)
  RI->IOGCR = CGCR_P1_PP_LOW_MASK | CGCR_SAMP_PP_LOW_MASK
#if NUMBER_OF_ACQUISITION_PORTS > 1
              | CGCR_P2_PP_LOW_MASK
#endif
              ;

  //wait for good discharging of all capacitors
  {u16 i;
    for (i = 0; i < 2000 ;i++) {}
  }

  //All IO in input with the analog switch OPEN
  RI->IOGCR = CGCR_P1_SW_OPEN_MASK | CGCR_SAMP_SW_OPEN_MASK
#if NUMBER_OF_ACQUISITION_PORTS > 1
              | CGCR_P2_SW_OPEN_MASK
#endif
              ;

  //close the analog switch of the channel used for the sampling capacitor
  //RI->IOGCR = CGCR_SAMP_SW_CLOSE_MASK;
}

/**
  ******************************************************************************
  * @brief Acquisition function for the 1st Channel IO of each group
  * @param[in] AcqNumber Number of times the acquisition is done.
  * @param[in] AdjustmentLevel Used to adjust the measured level.
  * @retval void None
  * @par Required preconditions:
  * None
  ******************************************************************************
  */
void TSL_IO_Acquisition_P1(u16 MaxAcqNumber)
{

  u16 MeasurementCounter;
#if SPREAD_SPECTRUM && !SW_SPREAD_SPECTRUM
  u8 HSI_fact_Calib;
#endif

  Channel_P1.Measure[0] = INIT_VALUE;
  Channel_P1.Measure[1] = INIT_VALUE;
  Channel_P1.Measure[2] = INIT_VALUE;
  Channel_P1.Measure[3] = INIT_VALUE;
  Channel_P1.Measure[4] = INIT_VALUE;
  Channel_P1.Measure[5] = INIT_VALUE;
  Channel_P1.Measure[6] = INIT_VALUE;
  Channel_P1.Measure[7] = INIT_VALUE;

#if (ACTIVE_SHIELD_GROUP)
	CCMR_P1   |= ACTIVE_SHIELD_GROUP;
#if NUMBER_OF_ACQUISITION_PORTS > 1
  CCMR_P2   &= (uint8_t)(~ACTIVE_SHIELD_GROUP);
#endif
#endif

	//P1 and Sampling capacitor IOs in input with the analog switch OPEN
  RI->IOGCR = (u8)((RI->IOGCR & (CGCR_P1_GLOBAL_MASK & CGCR_SAMP_GLOBAL_MASK)) | (CGCR_P1_SW_OPEN_MASK | CGCR_SAMP_SW_OPEN_MASK));

  //close the analog switch of the channel used for the sampling capacitor
  RI->IOGCR |= CGCR_SAMP_SW_CLOSE_MASK;

  Channel_P1.State.whole = 0x00;

  /*reset the counter*/
  MeasurementCounter = 0x0000;

  /*START spread spectrum*/
#if SPREAD_SPECTRUM && !SW_SPREAD_SPECTRUM
  /*save the user application calibration value*/
  if (CLK->HSITRIMR != 0x00) /*the application  use the Triming register*/
  {
    Previous_calibration_value = CLK->HSITRIMR;
  }
  else /*the application doesn't use the trimming register*/
  {
    Previous_calibration_value = CLK->HSICALR;
  }

