brzk4/Modbus-slave-STM8s/Libraries/STM8_TouchSensing_Driver/src/stm8l15x_tsl_ct_acquisition.c
  HSI_fact_Calib = CLK->HSICALR;
  CLK->HSIUNLCKR = 0xAC;
  CLK->HSIUNLCKR = 0x35;
  CLK->HSITRIMR = HSI_fact_Calib;

#endif

  /*loop while all the 1st channel of each group have not reach the VIH level*/
  do
  {
    /*charging the Ctouch cap with connecting the IO to Vdd (IO in push-pull HIGH)*/
    RI->IOGCR = (u8)((RI->IOGCR & CGCR_P2_GLOBAL_MASK) | CGCR_P2_PP_HIGH_MASK);

    if (CSR_SAMP & (uint8_t)~Channel_P2.State.whole)
    {
      /*To guaranty a good charging the high level on Ctouch has to be maintained about 2us.
      Instead of performing a waiting loop, the first part of the test to detect if a pin 
      has reach the VDDIO/2 threshold is performed here.*/
      if ((Channel_P2.State.b.Grp1 == 0) && ((CSR_SAMP&Group1) == Group1))
      {
        Channel_P2.Measure[0] = MeasurementCounter;
        Channel_P2.State.whole |= Group1;
      }
      if ((Channel_P2.State.b.Grp2 == 0) && ((CSR_SAMP&Group2) == Group2))
      {
        Channel_P2.Measure[1] = MeasurementCounter;
        Channel_P2.State.whole |= Group2;
      }
      if ((Channel_P2.State.b.Grp3 == 0) && ((CSR_SAMP&Group3) == Group3))
      {
        Channel_P2.Measure[2] = MeasurementCounter;
        Channel_P2.State.whole |= Group3;
      }
      if ((Channel_P2.State.b.Grp4 == 0) && ((CSR_SAMP&Group4) == Group4))
      {
        Channel_P2.Measure[3] = MeasurementCounter;
        Channel_P2.State.whole |= Group4;
      }
      if ((Channel_P2.State.b.Grp5 == 0) && ((CSR_SAMP&Group5) == Group5))
      {
        Channel_P2.Measure[4] = MeasurementCounter;
        Channel_P2.State.whole |= Group5;
      }

      if ((Channel_P2.State.b.Grp6 == 0) && ((CSR_SAMP&Group6) == Group6))
      {
        Channel_P2.Measure[5] = MeasurementCounter;
        Channel_P2.State.whole |= Group6;
      }
      if ((Channel_P2.State.b.Grp7 == 0) && ((CSR_SAMP&Group7) == Group7))
      {
        Channel_P2.Measure[6] = MeasurementCounter;
        Channel_P2.State.whole |= Group7;
      }
      if ((Channel_P2.State.b.Grp8 == 0) && ((CSR_SAMP&Group8) == Group8))
      {
        Channel_P2.Measure[7] = MeasurementCounter;
        Channel_P2.State.whole |= Group8;
      }
    }

    MeasurementCounter++;

    CLWHTA;  /**< programmable delay */

    /*charging the Csense cap with connecting it to Ctouch by closing the analog switch.
    Here the charge is transfered from the Ctouch to the Csens capacitors*/
    RI->IOGCR = (u8)((RI->IOGCR & CGCR_P2_GLOBAL_MASK) | CGCR_P2_SW_CLOSE_MASK);

#if SPREAD_SPECTRUM && !SW_SPREAD_SPECTRUM
    if (CLK->HSITRIMR > HSI_fact_Calib - SPREAD_COUNTER_MAX)
    {
      u8 Prev_HSI_TRIM;
      Prev_HSI_TRIM = (u8)(CLK->HSITRIMR - 1);
      CLK->HSIUNLCKR = 0xAC;
      CLK->HSIUNLCKR = 0x35;
      CLK->HSITRIMR = Prev_HSI_TRIM;
    }
    else
    {
      CLK->HSIUNLCKR = 0xAC;
      CLK->HSIUNLCKR = 0x35;
      CLK->HSITRIMR = HSI_fact_Calib ;
    }
#endif

    /*it's better to implement this like that because it's much more faster than to put this test in the "while test" below
      and only the MSByte is tested in order to speed the test up */
    if ((u8)(MeasurementCounter >> 8) > (u8)(MaxAcqNumber >> 8))
    {
      break;
    }
    /*wait for good discharging of the the Ctouch cap in the Csense */
    CLWLTA;  /**< programmable delay */
#if SPREAD_SPECTRUM && SW_SPREAD_SPECTRUM
    TSL_SW_Spread_Spectrum();
#endif

  }
  while (((Channel_P2.State.whole & Channel_P2.EnabledChannels) != Channel_P2.EnabledChannels));

#if SPREAD_SPECTRUM && !SW_SPREAD_SPECTRUM
  /*Restore the user application calibration value*/
  CLK->HSIUNLCKR = 0xAC;
  CLK->HSIUNLCKR = 0x35;
  CLK->HSITRIMR = Previous_calibration_value;
#endif

  //P2 and Sampling capacitor IOs in input with the analog switch OPEN
  RI->IOGCR = (u8)((RI->IOGCR & (CGCR_P2_GLOBAL_MASK & CGCR_SAMP_GLOBAL_MASK)) | (CGCR_P2_SW_OPEN_MASK | CGCR_SAMP_SW_OPEN_MASK));

  //P2 and Sampling capacitors IOs to LOW for discharing
  RI->IOGCR = (u8)((RI->IOGCR & (CGCR_P2_GLOBAL_MASK & CGCR_SAMP_GLOBAL_MASK)) | (CGCR_P2_PP_LOW_MASK | CGCR_SAMP_PP_LOW_MASK));

}
#endif
#endif


/* Public functions ----------------------------------------------------------*/

/******************* (C) COPYRIGHT 2011 STMicroelectronics *****END OF FILE****/
